Repository: miglius/drupal-ldap_provisioning
Catalog: translations/*.po
Languages: fr

source: General settings
fr: Paramètres généraux

source: Enable LDAP user provisioning
fr: Activer la création d'utilisateurs dans le LDAP

source: Custom username
fr: Nom d'utilisateur personalisé

source: Yes
fr: Oui

source: No
fr: Non

source: Allow to choose custom username in the registration form.
fr: Permettre de choisir un nom d'utilisateur personalisé dans le formulaire d'enregistrement

source: Username template
fr: Patron de nom d'utilisateur

source: Customize the username.
fr: Personaliser le nom d'utilisateur

source: Available variables are:
fr: Les variables disponibles sont :

source: first name
fr: prénom

source: first letter of first name, etc
fr: première lettre du prénom, etc

source: last name
fr: nom

source: first two letters of last name, etc
fr: deux premières lettres du prénom, etc

source: Use captcha in the registration form.
fr: Utiliser un captcha dans le formulaire d'enregistrement

source: Disable drupal user creation
fr: Désactiver la création d'utilisateur drupal

source: Whether the drupal user creation form for admin users should be disabled.
fr: Cocher si le formulaire de création d'utilisateur drupal pour les administrateurs doit être désactivé.

source: Enable custom initial password
fr: Autoriser un mot de passe initial personalisé

source: Allow to set an initial user password for the account manager. A random password will be generated if disabled.
fr: Autoriser un mot de passe utilisateur initial pour le gestionnaire de comptes. Un mot de passe aléatoire sera généré si désactivé.

source: Password length
fr: Longueur du mot de passe

source: Minimum password length for the new users.
fr: Longueur minimale du mot de passe pour les nouveaux utilisateurs.

source: Enable debugging
fr: Activer le débuggage

source: The LDIF entry will be print on the screen for configuration debugging.
fr: L'enregistrement LDIF sera affiché a l'écran pour débugger la configuration.

source: Registration form
fr: Formulaire d'enregistrement

source: Show groups in the registration form
fr: Afficher les groupes dans le formulaire d'enregistrement.

source: Groups are shown on the registration form according to their setup.
fr: Les groupes sont affichés sur le formulaire d'enregistrement en fonction de leur réglage.

source: Use profile fields in the registration form
fr: Utiliser les champs du profil dans le formulaire d'enregistrement

source: Profile fields are shown on the registration form according to their setup in the profile.
fr: Les champs du profil sont affichés sur le formulaire d'enregistrement en fonction de leur réglage.

source: Profile first name
fr: Prénom du profil

source: Profile field associated with the user's first name. When the field is set and custom usernames are not allowed, this field will be used to construct a username.
fr: Champ du profil associé avec le prénom de l'utilisateur. Quand le champ est rempli et que les noms d'utilisateurs personalisés ne sont pas autorisés, ce champ sera utilisé pour construire le nom d'utilisateur.

source: Profile last name
fr: Nom du profil

source: Profile field associated with the user's last name. When the field is set and custom usernames are not allowed, this field will be used to construct a username.
fr: Champ du profil associé avec le nom de l'utilisateur. Quand le champ est rempli et que les noms d'utilisateurs personalisés ne sont pas autorisés, ce champ sera utilisé pour construire le nom d'utilisateur.

source: Content profile first name
fr: Prénom du content profile

source: Content profile field associated with the user's first name. When the field is set and custom usernames are not allowed, this field will be used to construct a username.
fr: Champ du content profile associé avec le prénom de l'utilisateur. Quand le champ est rempli et que les noms d'utilisateurs personalisés ne sont pas autorisés, ce champ sera utilisé pour construire le nom d'utilisateur.

source: Content profile last name
fr: Nom du content profile

source: Content profile field associated with the user's last name. When the field is set and custom usernames are not allowed, this field will be used to construct a username.
fr: Champ du content profile associé avec le nom de l'utilisateur. Quand le champ est rempli et que les noms d'utilisateurs personalisés ne sont pas autorisés, ce champ sera utilisé pour construire le nom d'utilisateur.

source: Unsubscribe account creator from the created profile
fr: Désinscrire le créateur du compte du profil crée

source: If autosubscribe is configured, this setting unsubscribes the account manager from the user profiles he creates.
fr: Si l'auto-inscription est configurée, ce réglage désinscrit le gestionnaire de compte des profils utilisateurs qu'ils crée.

source: LDAP attribute %attr.
fr: Attribut LDAP %attr.

source: Additional registration attributes
fr: Attributs d'enregistrement additionels

source: A list of the custom attributes and corresponding form data to be shown on the registration form. The element type may be 'textifield' or 'textarea'. Please look at the following examples:<br /><code>sponsor|type=>textfield|title=>Sponsor POC|weigth=>4|size=>64|maxlemgth=>64|required=>1|description=>Sponsor Point of Contact.</code><br /><code>remarks|type=>textarea|title=>Remarks|weigth=>3|rows=>6|description=>Additional registration remarks.</code>
fr: Une liste d'attributs personalisé et les données de formulaires correspondantes a afficher dans le formulaire d'inscription. Le type d'élément peut être 'textfield' ou 'textarea'. Référez vous aux exemples suivants: <br /><code>sponsor|type=>textfield|title=>Sponsor POC|weigth=>4|size=>64|maxlemgth=>64|required=>1|description=>Sponsor Point of Contact.</code><br /><code>remarks|type=>textarea|title=>Remarks|weigth=>3|rows=>6|description=>Additional registration remarks.</code>

source: <p>Choose LDAP server new accounts will be created in.</p>
fr: <p>Choisir le serveur LDAP dans lequel les nouveaux comptes seront crées.</p>

source: LDAP server
fr: Serveur LDAP

source: Select LDAP server to create LDAP accounts in.
fr: Sélectionner le serveur LDAP où créer les comptes LDAP

source: Bind DN should have the rights to create new LDAP entries.
fr: Le Bind DN devrait avoir les droits pour créer de nouveaux enregistrements LDAP.

source: Password
fr: Mot de passe

source: Clear current password and change DN
fr: Supprimer le mot de passe actuel et changer le DN

source: Test
fr: Tester

source: LDAP attributes
fr: Attributs LDAP

source: Basic LDAP attributes
fr: Attributs LDAP basiques

source: Customize the rest LDAP attributes in LDIF style.
fr: Modifier le reste des attributs LDAP au format LDIF.

source: Empty lines and lines starting with "#" will be ignored.
fr: Les lignes vides et les lignes commençant par "#" seront ignorées.

source: E-mail settings
fr: Paramêtres E-mail

source: Drupal sends emails whenever new users register on your site, and optionally, may also notify users after other account actions. Using a simple set of content templates, notification e-mails can be customized to fit the specific needs of your site.
fr: Drupal envoie des emails à chaque fois d'un nouvel utilisateur s'enregistre sur votre site, et peut également, de manière optionnelle, notifier les utilisateurs lors d'autres actions sur leur compte. En utilisant un ensemble simple de modèles, les emails de notifications peuvent être personnalisées pour s'adapter aux besoins spécifiques de votre site.

source: Email validate
fr: E-mail de confirmation

source: Customize request validate messages sent to new members upon registering.
fr: Modifier le message de demande de confirmation envoyé aux nouveaux membres lors d' une inscription.

source: Subject of validate e-mail
fr: Sujet de l'e-mail de confirmation

source: Body of validate e-mail
fr: Corps de l'e-mail de confirmation

source: Account manager notify email
fr: E-mail de notification du gestionnaire de comptes

source: Customize account manager notification messages.
fr: Modifier le message de notification envoyé au gestionnaire de comptes

source: Subject of notify e-mail
fr: Sujet de l'e-mail de notification

source: Body of notify e-mail
fr: Corps de l'e-mail de notification

source: Account reject email
fr: E-mail de rejet

source: Customize request reject messages.
fr: Modifier le message de rejet.

source: Subject of reject e-mail
fr: Sujet de l'e-mail de rejet

source: Body of reject e-mail
fr: Corps de l'e-mail de rejet

source: Account create email
fr: E-mail de création de compte

source: Customize account creation notification messages.
fr: Modifier le message de notification de création de compte.

source: Subject of creation e-mail
fr: Sujet de l'e-mail de création

source: Body of creation e-mail
fr: Coprs de l'e-mail de création

source: Account delete email
fr: E-mail de suppression de compte

source: Customize account deletion notification messages.
fr: Modifier le message de notification de suppression de compte.

source: Subject of deletion e-mail
fr: Sujet de l'e-mail de suppression

source: Body of deletion e-mail
fr: Corps de l'e-mail de suppression

source: Save configuration
fr: Enregistrer la configuration

source: Reset to defaults
fr: Rétablir par défaut

source: Password lenght should be numeric.
fr: La longueur du mot de passe devrait être numérique.

source: Profile field %s is not found.
fr: Le champ de profil %s n'existe pas.

source: Profile field %s should be configured as "
fr: Le champ de profil %s devrait être configuré comme "

source: Visible in user registration form
fr: Visible dans le formulaire d'enregistrement

source: " and "
fr: " et "

source: The user must enter a value
fr: L'utilisateur doit entrer une valeur

source: If profile first name is set, the last name should be set as well.
fr: Si le prénom de profil est renseigné, le nom devrait l'être aussi.

source: If profile last name is set, the first name should be set as well.
fr: Si le nom de profil est renseigné, le prénom devrait l'être aussi.

source: Content profile field %s is not found.
fr: Le champ de content profile %s n'existe pas.

source: Content profile field %s should be configured as required
fr: Le champ de content profile %s devrait être configuré comme "

source: If content profile first name is set, the last name should be set as well.
fr: Si le prénom de content profile est renseigné, le nom devrait l'être aussi.

source: If content profile last name is set, the first name should be set as well.
fr: Si le nom de content profile est renseigné, le prénom devrait l'être aussi.

source: type and title are required.
fr: un type et un titre sont requis.

source: Bad attribute syntax.
fr: Mauvaise syntaxe d'attribut.

source: The configuration options have been saved.
fr: Les options de configuration ont été enregistrées.

source: The configuration options have been reset to their default values.
fr: Les options de configuration ont été réinitialisées à leurs valeurs par défaut.

source: Authentication with the LDAP server for the dn %dn and saved password failed.
fr: L'authentification sur le serveur LDAP avec le DN %dn et le mot de passe enregistré a échoué.

source: Authentication with the LDAP server for the dn %dn and saved password succeeded.
fr: L'authentification sur le serveur LDAP avec le DN %dn et le mot de passe enregistré a réussi.

source: Cannot load server settings. Please save configuration first.
fr: Echec du chargement des paramêtres du serveur. Veuillez d'abord sauver la configuration.

source: Authentication with the LDAP server succeeded.
fr: L'authentification sur le serveur LDAP a réussi.

source: Authentication with the LDAP server failed.
fr: L'authentification sur le serveur LDAP a échoué.

source: No entries available.
fr: Aucune entrée.

source: Please check your e-mail and click the link in the message to confirm your address. If you are unable to click the link, you can copy the secret code from the e-mail and enter it below.
fr: Veuillez vérifiez vos e-mails et cliquer sur le lien dans le message pour confirmer votre adresse. If vous ne pouvez pas cliquer sur le lien, vous pouvez copier le code secret de l'e-mail et le coller ici.

source: This page displays user accounts which have been requested but have not yet been approved (are not yet usable by the persons who requested them).
fr: Cette page affiche les comptes utilisateurs ayant été demandés mais n'ayant pas encore été approuvés (ils ne sont pas encore utilisables par les personnes les ayant demandé).

source: These accounts have been filled in by either a user or administrator and have been given administrator approval. An account here may be used to access this site.
fr: Ces comptes ont été renseignés par un utilisateur ou un administrateur et ont été approuvés par l'administrateur. Ces comptes peuvent être utilisés pour accéder au site.

source: These accounts were created by users requesting access to the site, but have been rejected by an administrator. An account here cannot be used to access this site.
fr: Ces comptes ont été crées par des utilisateurs ayant demandé un accès au site, mais ont été rejetés par un administrateur. Ces comptes ne peuvent pas être utilisés pour accéder au site.

source: These accounts have been removed from the system.
fr: Ces comptes ont été supprimés du système.

source: An unverified account has been requested by someone intending to access the site, but that person has not yet entered the code, emailed to them by the site, which verifies the validity of their email address and their status as a real person (and, therefore, not a spam program or virus).
fr: Un compte non vérifié à été demandé par quelqu'un essayant d'accéder au site, mais cette personne n'a pas encore entré le code leur ayant été envoyé par le site, code vérifiant la validité de leur adresse email et leur status de personne physique (et donc non un virus)

source: Validate your e-mail at !site
fr: Validez votre e-mail au !site

source: !first_name !last_name, Thank you for registering at !site. You may now validate your e-mail address by entering the code !code at !validate_uri (by copying and pasting). You may also validate the e-mail by clicking on this link or copying and pasting it in your browser: !validate_url -- !site team
fr: !first_name !last_name, Merci de vous être enregistré au !site. Vous pouvez maintenant valider votre adresse e-mail en entrant le code !code a l'adresse !validate_uri (en copiant et collant). Vous pouvez aussi valider l-email en clickant sur ce lien, ou en le copiant-collant dans votre navigateur web: !validate_url -- l'équipe du !site

source: Your request at !site has been rejected
fr: Votre demande au !site a été rejetée

source: !first_name !last_name, Sorry, but your account request at !site has been rejected. Please resubmit the registration form with more information. ----- !message -- !site team
fr: !first_name !last_name, Désolé, mais votre demande de compte au !site a été rejetée. Veuillez re-soumettre le formulaire d'enregistrement pour plus d'informations. ----- !message -- l'équipe du !site

source: New account request at !site
fr: Nouvelle demande de compte au !site

source: !first_name !last_name (!mailto) has requested the account at !site. Click this link !create_url to process the request.
fr: !first_name !last_name (!mailto) a demandé un compte au !site. Cliquer sur ce lien !create_url pour traiter la demande.

source: The account has been created for you at !site
fr: Votre compte au !site a été crée

source: !first_name !last_name, The account at !site has been created for you. You may now log in to !login_uri using the following username and password: username: !username password: !password You may also log in by clicking on this link or copying and pasting it in your browser: !login_url This is a one-time login, so it can be used only once. ----- !message -- !site team
fr: !first_name !last_name, Votre compte au !site a été crée. Vous pouvez maintenant vous authentifier sur !login_uri avec les nom d'utilisateur et mot de passe suivants: nom d'utilisateur: !username mot de passe: !password Vous pouvez aussi vous authentifier en cliquant sur ce lien ou en le copiant-collant dans votre navigateur web: !login_url C'est une authentification à usage unique, elle ne peut être utilisée qu'une fois. ----- !message -- l'équipe du !site

source: Your account has been deleted at !site
fr: Votre compte au !site a été supprimé

source: !first_name !last_name, Your account !username has been deleted at !site. -- !site team
fr: !first_name !last_name, Votre compte !username au !site a été supprimé !site. -- l'équipe du !site

source: User data could not be read in the LDAP directory. Please contact site administrator.
fr: Les informations utilisateur n'ont pas pu être lues dans l'annuaire LDAP. Veuillez consulter l'administrateur du site.

source: The DN %dn is already taken in LDAP.
fr: Le DN %dn est déja utilisé dans le LDAP.

source: User update: user data could not be read in the LDAP directory. Please contact site administrator.
fr: Mise à jour d'utilisateur : les informations utilisateur n'ont pas pu être lues dans l'annuaire LDAP. Veuillez consulter l'administrateur du site.

source: The user !name has not been deleted from the LDAP directory.
fr: L'utilisateur !name n'a pas été supprimé de l'annuaire LDAP.

source: edit
fr: modifier

source: Request new account
fr: Créer un nouveau compte

source: The code %code has already been validated.
fr: Le code %code a déja été validé.

source: The code %code is not valid or has expired.
fr: Le code %code n'est pas valide ou a expiré.

source: Account information
fr: Informations du compte

source: Username
fr: Nom d'utilisateur

source: Your full name or your preferred username; only letters, numbers and spaces are allowed.
fr: Votre nom complet ou votre nom d'utilisateur préféré : uniquement les lettres, chiffres et espaces sont autorisés.

source: First Name
fr: Prénom

source: Last Name
fr: Nom

source: E-mail address
fr: Adresse électronique

source: A password and instructions will be sent to this e-mail address, so make sure it is accurate.
fr: Un mot de passe et des instructions seront envoyées à cette adresse, veillez bien à ce qu'elle soit valide.

source: Username cannot begin with a space.
fr: Le nom d'utilisateur ne peut pas commencer par un espace.

source: Username cannot end with a space.
fr: Le nom d'utilisateur ne peut pas finir par un espace.

source: Username should contain only letters, numbers and spaces.
fr: Le nom d'utilisateur devrait contenir uniquement des lettres, des chiffres et des espaces.

source: The username %name is already taken. Please choose different one.
fr: Le nom d'utilisateur %name est déja pris. Veuillez en choisir un autre.

source: User validate: user data could not be read in the LDAP directory. Please contact site administrator.
fr: Validation d'utilisateur : les informations utilisateur n'ont pas pu être lues dans l'annuaire LDAP. Veuillez consulter l'administrateur du site.

source: The e-mail address %mail is not valid.
fr: L'adresse e-mail %mail n'est pas valide.

source: The user with e-mail address %mail is already registered with the system. Click !request if you forgot your login information.
fr: L'utilisateur avec l'adresse e-mail %mail est déja enregistré dans le système. Cliquez sur !request si vous avez oublié vos informations de connexion.

source: request new password
fr: Demander un nouveau mot de passe

source: First Name cannot begin with a space.
fr: Le prénom ne peut pas commencer par un espace.

source: First Name cannot end with a space.
fr: Le prénom ne peut pas finir par un espace.

source: First Name should contain only latin letters, apostrophe, dash or space.
fr: Le prénom devrait contenir uniquement des lettres, des apostrophes, des tirets ou des espaces.

source: Last Name cannot begin with a space.
fr: Le nom ne peut pas commencer par un espace.

source: Last Name cannot end with a space.
fr: Le nom ne peut pas finir par un espace.

source: Last Name should contain only latin letters, apostrophe, dash or space.
fr: Le nom devrait contenir uniquement des lettres, des apostrophes, des tirets ou des espaces.

source: First Name can not contain only whitespace characters.
fr: Le prénom ne peut pas contenir uniquement des caractères vides.

source: Last Name can not contain only whitespace characters.
fr: Le nom ne peut pas contenir uniquement des caractères vides.

source: Password should be at least %length characters in length.
fr: Le mot de passe devrait comporter au moins %length caractères.

source: Please wait until your account is approved. You will receive login information to your e-mail account.
fr: Veuillez patienter en attendant que votre compte soit validé. Vous recevrez vos informations de connexion par e-mail.

source: An e-mail has been sent to the e-mail account %s to verify that you have entered a valid e-mail address.
fr: Un e-mail a été envoyé a l'adresse %s pour vérifier que l'adresse e-mail que vous avez fourni est valide.

source: Unable to send mail. Please contact the site admin.
fr: Impossible d'envoyer un e-mail. Veuillez contacter l'administrateur du site.

source: Secret Code
fr: Code Secret

source: Validate
fr: Valider

source: The code %s has already been validated.
fr: Le code %s a déja été validé.

source: The code %s is not valid.
fr: Le code %s n'est pas valide.

source: Your e-mail account %mail has been validated. Please wait until your account is approved. You will receive login information to your e-mail account.
fr: Votre adresse e-mail %mail a été validée. Veuillez patienter en attendant que votre compte soit approuvé. Vous recevrez vos informations de connexion par e-mail.

source: Your password and further instructions have been sent to your e-mail address.
fr: Votre mot de passe ainsi que des instructions détaillées ont été envoyés à votre adresse e-mail.

source: The new user was not created. Please contact site administrator.
fr: Le nouvel utilisateur n'a pas été crée. Veuillez contacter l'administrateur du site.

source: Update options
fr: Options de mise à jour

source: Join %group.
fr: Rejoindre %group.

source: Groups
fr: Groupes

source: Join users to these groups on account creation.
fr: Abonner les utilisateurs à ces groupes lors de la création de compte.

source: Signups
fr: Abonnements

source: Signup users to these nodes on account creation.
fr: Abonner les utilisateurs à ces noeuds lors de la création de compte.

source: Create the selected users
fr: Créer les utilisateurs sélectionnés

source: Reject the selected users
fr: Rejeter les utilisateurs sélectionnés

source: Update
fr: Mise à jour

source: Submission Date
fr: Date de soumission

source: Approval Date
fr: Date d'approbation

source: Approver
fr: Approuver

source: Account
fr: Compte utilisateur

source: Processing user creation
fr: Traitement de la création d'utilisateur

source: User creation is starting.
fr: La création d'utilisateur commence.

source: Processing...
fr: Traitement...

source: User creation has encountered an error.
fr: La création d'utilisateur a échoué.

source: User creation: user data could not be read in the LDAP directory. Please contact site administrator.
fr: Création d'utilisateur : les informations utilisateur n'ont pu être lues dans l'annuaire LDAP. Veuillez contacter l'administrateur du site.

source: User with an e-mail address %mail was not created.
fr: L'utilisateur avec l'adresse e-mail %mail n'a pas été crée.

source: The new user !name has been created.
fr: Le nouvel utilisateur !name a été crée.

source: Please choose at least one request.
fr: Veuillez choisir au moins une demande.

source: Following users were created.
fr: Les utilisateurs suivants ont été crées.
