Repository: miglius/drupal-ldap_provisioning
Catalog: translations/*.po
Languages: fr

source: Users with the following e-mails were not created. Please create them manually.
fr: Les utilisateurs avec les adresses suivantes n'ont pas été crées. Veuillez les créer manuellement.

source: An error occurred while processing %error. Please contact site administrator.
fr: Un erreur est survenue en traitant %error. Veuillez contacter l'administrateur du site.

source: Invited by !name
fr: Invité par !name

source: , context: !context.
fr: , contexte : !context.

source: Leave this field empty and the password will be autogenerated.
fr: Laissez ce champ vide et le mot de passe sera généré.

source: Roles
fr: Rôles

source: The user receives the combined permissions of the %au role, and all roles selected here.
fr: L'utilisateur se voit attribuer les permissions combinées du rôle %au, et de tout les rôles sélectionnés ici.

source: authenticated user
fr: utilisateur identifié

source: This message will be added to the notification e-mail sent out.
fr: Ce message sera ajouté a l'e-mail de notification envoyé.

source: Internal notes shared between account managers.
fr: Notes internes partagées entre les gestionnaires de comptes.

source: Create account
fr: Créer un compte

source: Reject account
fr: Rejeter un compte

source: Save notes
fr: Sauvegarder les notes

source: The request was rejected at %date by !name.
fr: La demande a été rejetée le %date par !name.

source: The user !name was created at %date by !cname.
fr: L'utilisateur !name a été crée le %date par !cname.

source: The account was deleted at %date by !name.
fr: Le compte a été supprimé le %date par !name.

source: An account with a username %name and e-mail %mail is already created in the system. If you proceed, a new account will be created with a number appended to the username.
fr: Un compte avec le nom d'utilisateur %name et l'e-mail %mail existe déja sur le système. Si vous continuez, un nouveau compte sera crée avec un numéro ajouté au nom d'utilisateur.

source: User registration: user data could not be read in the LDAP directory. Please contact site administrator.
fr: Enregistrement utilisateur : les données utilisateur n'ont pas pu être lues dans l'annuaire LDAP. Veuillez contacter l'administrateur du site.

source: The notes have been saved.
fr: Les notes ont été sauvegardées.

source: Error! User data could not be read in the LDAP directory. Please contact site administrator.
fr: Erreur! Les informations utilisateur n'ont pas pu être lues dans l'annuaire LDAP. Veuillez contacter l'administrateur du site.

source: The account request for %first %last (%mail) has been rejected.
fr: La demande de comte pour %first %last (%mail) a été rejetée.

source: Upload accounts
fr: Télécharger des comptes

source: Upload users data in xml or csv format. The templates can be downloaded for the !xml or !csv formats
fr: Télécharger des données de comptes utilisateur au format xml ou csv. Les patrons peuvent être téléchargés pour les formats !xml et !csv

source: Attach new file
fr: Attacher un nouveau fichier

source: The file should be provided.
fr: Un fichier devrait être fourni.

source: Unsupported file extension %ext.
fr: Extension de fichier non supportée %ext.

source: The users data from the file %file has been uploaded.
fr: Les données de comptes utilisateurs ont été téléchargées à partir du fichier %file.

source: Error: %error in file %file.
fr: Erreur : %error dans le fichier %file.

source: File %file has unsupported extension %extension.
fr: Le fichier %file a une extension non supportée %extension.

source: First name
fr: Prénom

source: required
fr: requis

source: Last name
fr: Nom

source: E-mail
fr: Adresse électronique

source: XML error: %error at line %line
fr: Erreur XML : %error a la ligne %line

source: The node %title would not be accessible to created users. The users should also be added to one of the groups the node belongs to, therefore, select any of the following groups: %groups.
fr: Le noeud %title ne serait pas accessible aux utilisateurs crées. Les utilisateurs devraient aussi être ajoutés a un des groups auxquels le noeur appartient, pour ceci sélectionnez un des groupes suivants : %groups.

source: User validate: user data could not be read in the LDAP directory. Could not bind as %dn.
fr: Validation utilisateur : les données utilisateur n'ont pas pu être lues dans l'annuaire LDAP. Impossible de se connecter en tant que %dn.

source: User update: user data could not be read in the LDAP directory. Could not bind as %dn.
fr: Mise à jour utilisateur : les données utilisateur n'ont pas pu être lues dans l'annuaire LDAP. Impossible de se connecter en tant que %dn

source: User update: user %name ldap entry %dn was not renamed to a new name %name_new.
fr: Mise à jour utilisateur : l'enregistrement LDAP %dn de l'utilisateur %ldap n'a pas été renommée en %name_new.

source: User deletion: user data could not be read in the LDAP directory. Could not bind as %dn.
fr: Suppression d'utilisateur : les données utilisateur n'ont pas pu être lues dans l'annuaire LDAP. Impossible de se connecter en tant que %dn.

source: User deletion: user %name has been deleted from the LDAP directory.
fr: Suppression d'utilisateur : l'utilisateur %name a été supprimé de l'annuaire LDAP.

source: User deletion: user %name has not been deleted from the LDAP directory.
fr: Suppression d'utilisateur : l'utilisateur %name n'a pas été supprimé de l'annuaire LDAP.

source: User deletion: user %name is not found in LDAP directory.
fr: Suppression d'utilisateur : l'utilisateur %name n'a pas été trouvé dans l'annuaire LDAP.

source: Account deletion notification e-mail mailed to %name at %mail.
fr: E-mail de notification de suppression de compte envoyé a %name (%mail).

source: Error mailing account deletion notification to %name at %mail.
fr: Erreur lors de l'envoi de l'e-mail de notification de suppression de compte a %name (%mail).

source: E-mail validation request mailed to %first_name %last_name at %mail.
fr: E-mail de confirmation envoyé a %first_name %last_name (%mail).

source: Error mailing e-mail validation request to %first_name %last_name at %mail.
fr: Erreur lors de l'envoi de l'e-mail de confirmation a %first_name %last_name (%mail).

source: E-mail notification message about %first_name %last_name account request mailed to %mail.
fr: E-mail de notification a propos de la demande de compte de %first_name %last_name envoyé à %mail.

source: Error mailing notification e-mail about %first_name %last_name account request mailed to %mail.
fr: Erreur lors de l'envoi de l'e-mail de notification a propos de la demande de compte de %first_name %last_name a %mail.

source: User creation: user data could not be read in the LDAP directory. Could not bind as %dn.
fr: Création d'utilisateur : les données utilisateur n'ont pas pu être lues dans l'annuaire LDAP. Impossible de se connecter en tant que %dn.

source: User registration: user data could not be read in the LDAP directory. Could not bind as %dn.
fr: Enregistrement utilisateur : les données utilisateur n'ont pas pu être lues dans l'annuaire LDAP. Impossible de se connecter en tant que %dn.

source: A new external user %name was created using module %module.
fr: Un nouvel utilisateur externe %name a été crée en utilisant le module %module.

source: Account creation notification e-mail mailed to %name at %mail.
fr: E-mail de notification de création de compte envoyé a %name (%mail).

source: Error mailing account creation notification to %name at %mail.
fr: Erreur lors de l'envoi de l'e-mail de notification de création de compte a %name (%mail).

source: User creation: user was not created in the LDAP directory.
fr: Création d'utilisateur : l'utilisateur n'a pas été crée dans l'annuaire LDAP.

source: E-mail rejection message mailed to %first_name %last_name at %mail.
fr: E-mail de rejet envoyé à %first_name %last_name (%mail).

source: Error mailing rejection e-mail to %first_name %last_name at %mail.
fr: Erreur lors de l'envoi de l'e-mail de rejet à %first_name %last_name (%mail).

source: Provisioning
fr: Approvisionnement

source: Configure LDAP provisioning settings.
fr: Configurer les paramêtres d'approvisionnement LDAP.

source: Test LDAP Server
fr: Tester le serveur LDAP

source: Account management
fr: Gestion des comptes

source: Configure LDAP provisioning accounts.
fr: Configurer les comptes d'approvisionnement LDAP.

source: Pending
fr: En attente

source: Created
fr: Crée

source: Rejected
fr: Rejeté

source: Deleted
fr: Supprimé

source: Unverified
fr: Non vérifié

source: Create
fr: Créer

source: Create user
fr: Créer un utilisateur

source: Batch upload file template
fr: patron de téléchargement en batch

source: ldapprov module successfully installed. Please review the available <a href="@settings">configuration settings</a>.
fr: module ldapprov installé avec succès. Veuillez consulter les <a href "@settings">paramêtres de configuration</a> disponibles.

source: Stores LDAP provisioning user registration data.
fr: Stocke les paramêtres d'approvisionnement LDAP.

source: The registration ID.
fr: ID d'enregistrement.

source: {users}.name user's name.
fr: {users}.name nom d'utilisateur.

source: User's email address.
fr: Adresse email de l'utilisateur.

source: User's first name.
fr: Prénom de l'utilisateur.

source: User's last name.
fr: Nom de l'utilisateur.

source: Secret code to validate e-mail address.
fr: Code secret pour valider l'adresse e-mail.

source: Whether the user is unverified(0), pending(1), rejected(2), created(3) or deleted(4).
fr: Selon que l'utilisateur est non vérifié(0), en attente(1), rejeté(2), crée(3) ou supprimé(4).

source: Timestamp for when user filed in registration form.
fr: Epoch ou l'utilisateur a rempli le formulaire d'enregistrement

source: A serialized array of registration data.
fr: Un tableau sérialisé de données d'enregistrement.

source: Timestamp for when user has been approved.
fr: Epoch ou l'utilisateur a été approuvé.

source: {users}.uid of the account approver.
fr: {users}.uid de la personne ayant approuvé le compte.

source: {users}.name account approver's name.
fr: {users}.name nom de la personne ayant approuvé le compte.

source: {users}.uid of the created user.
fr: {users}.uid de l'utilisateur crée.

source: A user registration notes.
fr: Notes sur l'enregistrement d'un utilisateur.

source: Implements LDAP users provisioning.
fr: Implémente l'approvisionnement d'utilisateurs LDAP.

source: LDAP integration
fr: Intégration LDAP

source: Settings
fr: Paramètres

source: Enable LDAP invites
fr: Autoriser les invitations LDAP

source: "From" e-mail address
fr: "De" adresse e-mail

source: Choose which e-mail address will be in the From: header for the invitation mails sent. %site will use the default e-mail address of the site, whereas %inviter will use the e-mail address of the person who is sending the invitation.
fr: Choisissez quel adresse e-mail sera dans l'en-tête De: pour les e-mails d'invitation envoyés. %site utilisera l'adresse e-mail par défaut du site, alors que %inviter utilisera l'adresse e-mail de la personne envoyant l'invitation.

source: Invite email
fr: E-mail d'invitation

source: Subject of invite e-mail
fr: Sujet de l'e-mail d'invitation

source: Customize the subject of your invite e-mail message.
fr: Personalisez le sujet de l'e-mail d'invitation.

source: Body of invite e-mail
fr: Corps de l'e-mail d'invitation

source: Customize the body of your invite e-mail message.
fr: Personalisez le corps de l'e-mail d'invitation.

source: You have been invited to the !site
fr: Vous avez été invité au !site

source: Your friend, !name has invited you to join !site site. You may now register to the site at !register_uri ---------- !message -- !site team
fr: Votre ami, !name vous a invité a rejoindre le site du !site. Vous pouvez vous enregistrer sur le site a !register_uri ---------- !message -- l'équipe du !site

source: Invite a contact to the site
fr: Inviter un contact sur le site

source: To
fr: Pour

source: Type the comma separated list of e-mails of the people you would like to invite to the site.
fr: Tapez une liste séparée par des virgules d'e-mails des personnes que vous aimeriez inviter sur le site.

source: Your message
fr: Votre message

source: This message will be added to the e-mails sent to the people you are inviting to the site.
fr: Ce message sera ajouté aux e-mails envoyé aux personnes que vous invitez sur le site.

source: Invite
fr: Inviter

source: The invitation already was sent to user with e-mail address %mail.
fr: L'invitation a déja été envoyée a l'utilisateur avec l'e-mail %mail.

source: The user with e-mail address %mail is already registered with the system.
fr: L'utilisateur avec l'e-mail %mail est déja enregistré sur le système.

source: The invite has been mailed to e-mail address %mail.
fr: L'invitation a été envoyée a l'adresse %mail.

source: Sent
fr: Envoyé

source: Status
fr: Statut

source: Blocked
fr: Bloqué

source: Joined
fr: Rejoint

source: resend
fr: réenvoyer

source: delete
fr: supprimer

source: No invites
fr: Pas d'invitation

source: The invitation to %mail has been deleted.
fr: L'invitation de %mail a été supprimée.

source: Unable to delete the invite.
fr: Impossible de supprimer l'invitation.

source: Invite e-mail was mailed from %name to %mail.
fr: L'e-mail d'invitation a été envoyé de %name a %mail

source: Error mailing invite e-mail from %user to %mail.
fr: Erreur lors de l'envoi de l'e-mail d'invitation de %name a %mail

source: Invites
fr: Invitations

source: Manage invites
fr: Gérer les invitations

source: Resend
fr: Réenvoyer

source: Delete
fr: Supprimer

source: ldapprov_invite module successfully installed. Please review the available <a href="@settings">configuration settings</a>.
fr: ldapprov_invite module installé avec succés. Veuillez consulter les <a href="@settings">paramêtres de configuration</a> disponibles.

source: The invitation ID.
fr: ID d'invitation.

source: {users}.uid of the inviter.
fr: {users}.uid de l'inviteur.

source: Email address an invite was sent to.
fr: Adresse e-mail a laquelle une invitation a été envoyée.

source: A message was mailed in invitation.
fr: Un message a été envoyé dans l'invitation.

source: A serialized array of invitation data.
fr: Un tableau sérialisé d'information d'invitation.

source: {ldapprov}.rid registration ID.
fr: {ldapprov}.rid ID d'enregistrement.

source: Timestamp for when an invitation was sent out.
fr: Epoch a laquelle une invitation a été envoyée.

source: Visibility
fr: Visibilité

source: Enable tab on the group's homepage
fr: Activer l'onglet sur la page d'accueil du groupe

source: If enabled, the tab will be shown on the group's homepage. Otherwise this functionality will be available from the menu.
fr: Si activé, l'onglet sera affiché sur la page d'accueil du groupe. Sinon, cette fonctionalité sera disponible dans le menu.

source: Your friend, !name has invited you to join a group "!group" at !site site. You may now register to the site at !register_uri ---------- !message -- !site team
fr: Votre ami, !name vous a invité a rejoindre le groupe "!group" sur le site du !site. Vous pouvez vous enregistrer sur le site a !register_uri ---------- !message -- l'équipe du !site

source: Invite a contact to the group
fr: Inviter un contact au groupe

source: If you invite a new user to the site, then upon registration the user will be subscribed to the group %group based on the group membership settings. If you invite an existing user, the user will receive an e-mail message with the invitation to join the group.
fr: Si vous invitez un nouvel utilisateur au site, lors de l'enregistrement l'utilisateur sera abonné au groupe %group selon les réglages d'abonnement au groupe. Si vous invitez un utilisateur existant, il recevra un e-mail d'invitation a rejoindre ce groupe.

source: Type the comma separated list of e-mails of the people you would like to invite to the group.
fr: Tapez une liste séparée par des virgules d'e-mails de personnes que vous aimeriez inviter a rejoindre le groupe.

source: This message will be added to the e-mails sent to the people you are inviting to the group.
fr: Ce message sera ajouté aux e-mails envoyés aux personnes que vous invitez a rejoindre le groupe.

source: You may not invite yourself - @self.
fr: Vous ne pouvez pas vous inviter vous-même - @self.

source: A user %name with the e-mail address %mail is blocked.
fr: Un utilisateur %name avec l'e-mail %mail est bloqué.

source: A user %name with the e-mail address %mail is already a member of the group.
fr: Un utilisateur %name avec l'e-mail %mail est déja membre du groupe.

source: Invalid email address: @value.
fr: Adresse e-mail invalide : @value.

source: Group !group
fr: Groupe !group

source: Configure OG invites for LDAP provisioning settings.
fr: Configurer les invitations OG pour l'approvisionnement LDAP.

source: Invite autocomlete
fr: Autocomplétion des invitations

source: ldapprov_invite_og module successfully installed. Please review the available <a href="@settings">configuration settings</a>.
fr: module ldapprov_invite_og installé avec succès. Veuillez consulter les <a href="@settings">paramêtres de configuration</a> disponibles.

source: Your friend, !name has invited you to signup for a "!title" at !site site. You may now register to the site at !register_uri ---------- !message -- !site team
fr: Votre ami, !name vous a invité a vous abonner pour un "!title" au site !site. Vous pouvez vous enregister sur le site a !register_uri ---------- !message -- l'équipe du !site

source: A user %name with the e-mail address %mail is already signuped to the node.
fr: Un utilisateur %name avec l'e-mail est déja abonné au noeud.

source: Node !title
fr: Noeud !title
